app/Controllers/Clientes.php

SELECT *
FROM `registros`
WHERE `reg_estado` = 1
---
    public function index(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('reg_estado', 1)->findAll();

SELECT *
FROM `registros`
WHERE `reg_estado` = 1
---
    public function show($id){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('reg_estado', 1)->findAll();

SELECT *
FROM `registros`
WHERE `reg_estado` = 1
---
    public function create(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('reg_estado', 1)->findAll();

INSERT INTO `clientes` (`per_id`) VALUES ('2')
---
                                    "per_id"=>$datos["per_id"]
                                );
                                $model = new ClientesModel();
                                $cliente = $model->insert($datos);

SELECT *
FROM `registros`
WHERE `reg_estado` = 1
SELECT *
FROM `clientes`
WHERE `clientes`.`cli_id` = '2'
---
    public function update($id){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('reg_estado', 1)->findAll();
        foreach($registro as $key=>$value){
            if(array_key_exists('Authorization',$headers) && !empty($headers['Authorization'])){
                if($request->getHeader('Authorization')=='Authorization: Basic '
                .base64_encode($value['reg_clientes_id'].':'.$value['reg_llave_secreta'])){
                        $datos = $this->request->getRawInput();
                        if(!empty($datos)){
                             $validation->setRules([
                                "per_id"=>'required|integer'

                            ]);
                            $validation->withRequest($this->request)->run();
                            if($validation->getErrors()){
                                $errors = $validation->getErrors();
                                $data = array(
                                    "Status"=>404,
                                    "Detalle"=>$errors
                                );
                                return json_encode($data, true);
                            }
                            else{
                                $model = new ClientesModel();
                                $clientes = $model->find($id);