app/Controllers/Personas.php

SELECT *
FROM `registros`
WHERE `reg_estado` = 1
SELECT *
FROM `personas`
WHERE `per_estado` = 1
AND `personas`.`per_id` = '6'
---
    public function show($id){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('reg_estado', 1)->findAll();

        foreach($registro as $key=>$value){
            if(array_key_exists('Authorization',$headers) && !empty($headers['Authorization'])){
                if($request->getHeader('Authorization')=='Authorization: Basic '
                .base64_encode($value['reg_clientes_id'].':'.$value['reg_llave_secreta'])){
                    $model = new PersonasModel();
                    $personas = $model->where('per_estado',1)->find($id);

SELECT *
FROM `registros`
WHERE `reg_estado` = 1
SELECT *
FROM `personas`
WHERE `per_estado` = 1
AND `personas`.`per_id` = '6'
UPDATE `personas` SET `per_estado` = 0
WHERE `personas`.`per_id` IN ('6')
---
    public function delete($id){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('reg_estado', 1)->findAll();

        foreach($registro as $key=>$value){
            if(array_key_exists('Authorization',$headers) && !empty($headers['Authorization'])){
                if($request->getHeader('Authorization')=='Authorization: Basic '
                .base64_encode($value['reg_clientes_id'].':'.$value['reg_llave_secreta'])){
                    $model = new PersonasModel();
                    $persona = $model->where('per_estado',1)->find($id);
                    if(!empty($persona)){
                        $datos = array("per_estado"=>0);
                        $persona = $model->update($id, $datos);