app/Controllers/Trabajadores.php

    public function index(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('reg_estado', 1)->findAll();
---
SELECT *
FROM `registros`
WHERE `reg_estado` = 1

    public function show($id){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('reg_estado', 1)->findAll();
---
SELECT *
FROM `registros`
WHERE `reg_estado` = 1